<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Языковые ресурсы постраничного вывода
    |--------------------------------------------------------------------------
    |
    | Последующие языковые строки используются библиотекой постраничного вывода
    | для создания простых ссылок на страницы. Вы можете поменять их на любые
    | другие, которые лучше подходят для вашего приложения.
    |
    */
    'save' => 'Успешно сохранен',
    'event_order' => 'Поздравляю! Успешно отправлено',
    'delete' => 'Успешно удалено',
    'access_is_denied' => 'Доступ запрещен',
    'error' => 'Ошибка',
    'send_message' => 'Ваше сообщение успешно отправлено',
    'ticket_activate' => 'Билет успешно активирован',
    'ticket_not_found' => 'Билет не найден',
    'ticket_is_activate' => 'Билет уже активирован'
];