<?php

namespace App\Enums;

/**
 * Перечисление регулярных выражений
 *
 * @author Amantay Orynbayev
 */
class RegexEnum extends Enum
{
    const KZ_MOBILE_PHONE = '/^[+]7[(][0-9]{3}[)][0-9]{3}-[0-9]{2}-[0-9]{2}$/'; # номер телефона Казахстан
    //Съедает следующие телефоны:
    //+7(903)888-88-88
    //8(999)99-999-99
    //+380(67)777-7-777
    //001-541-754-3010
    //+1-541-754-3010
    //19-49-89-636-48018
    //+233 205599853
    const MOBILE_PHONE = '/^(\s*)?(\+)?([- _():=+]?\d[- _():=+]?){10,14}(\s*)?$/'; # номер телефона
    const EMAIL = '/^[_a-z0-9-]+(\.[_a-z0-9-]+)*@[a-z0-9-]+(\.[a-z0-9-]+)*(\.[a-z]{2,4})/'; # электронный адрес
    const KZ_MOBILE_PHONE_OR_EMAIL = '/^([_a-z0-9-]+(\.[_a-z0-9-]+)*@[a-z0-9-]+(\.[a-z0-9-]+)*(\.[a-z]{2,4}))|([+]7[(][0-9]{3}[)][0-9]{3}-[0-9]{2}-[0-9]{2})/';
}